#coding:utf-8

problem1 = {
    'main':u"确定目标准确(符合课程标准)、恰当、具体，能体现三维目标，并具有可操作性。",'A':u'满意','B':u'良好','C':u'一般','D':u'有待提高'}

problem2 = {
    'main': u"根据学科特点，概述本课内容及其地位，并准确列出知识点、重点、难点等。理解教材，对教材分析透彻。",'A':u'满意','B':u'良好','C':u'一般','D':u'有待提高'}

problem3 = {
    'main':u'结合所教内容，针对学生实际，从知识、情意、潜能等方面进行分析。对学生的分析符合年龄、心理特点；了解学生有关知识储备和生活经验。','A':u'满意','B':u'良好','C':u'一般','D':u'有待提高'}

problem4 = {
    'main':u"有明确的教学理念，且符合课改精神。针对不同的教学内容来设定教学的价值取向。",'A':u'满意','B':u'良好','C':u'一般','D':u'有待提高'}

problem5 = {
    'main':u"设计中能体现主要的教法、学法。突出重点、破解难点的方法科学有效。",'A':u'满意','B':u'良好','C':u'一般','D':u'有待提高'}

problem6 = {
    'main':u"明确使用那些教具、学具或电教媒体。媒体使用有利于突破重点、难点和关键问题。",'A':u'满意','B':u'良好','C':u'一般','D':u'有待提高'}

problem7 = {
    'main':u"板书简明、精要、重点突出，布局合理。",'A':u'满意','B':u'良好','C':u'一般','D':u'有待提高'}

problem8 = {
    'main':u"练习设计体现知识的综合运用，形式多样，份量与难度适中；有层次，选做与必做结合，课内与课外结合，注意发展学科实践活动课程。",'A':u'满意','B':u'良好','C':u'一般','D':u'有待提高'}

problem9 = {
    'main':u"对自己的教学进行总结反思，写出教学后记、反思小结或自我点评。",'A':u'满意','B':u'良好','C':u'一般','D':u'有待提高'}

problem10 = {
    'main':u"有新授课、复习课、练习课、实验课和试卷评析课等课型。",'A':u'满意','B':u'良好','C':u'一般','D':u'有待提高'}

problem11 = {
    'main':u"按规定数量要求备足课时。",'A':u'满意','B':u'良好','C':u'一般','D':u'有待提高'}

problems = [problem1,problem2,problem3,problem4,problem5,problem6,problem7,problem8,problem9]